pl_0_60X604/0/qin
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      qin;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    radinlet
    {
        type            calculated;
        value           uniform 0 ;
    }
    hotwall
    {
         type            calculated;
         value           uniform 0 ;
      //  value           uniform(0 0 0) ;
    }
    coldwall
    {
         type            calculated;
         value           uniform 0 ;
      //  value           uniform(0 0 0) ;
    }
    topwall
    {
        type            calculated;
        value           uniform 0 ;
      //  value           uniform(0 0 0) ;
    }
    bottomwall
    {
        type            calculated;
        value           uniform 0 ;
      //  value           uniform(0 0 0) ;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
